sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/afec.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_LCDR_OFFSET                    (0x20)                                        /**<  (AFEC_LCDR) AFEC Last Converted Data Register  Offset */

#define AFEC_LCDR_LDATA_Pos                 0                                              /**< (AFEC_LCDR) Last Data Converted Position */
#define AFEC_LCDR_LDATA_Msk                 (_U_(0xFFFF) << AFEC_LCDR_LDATA_Pos)           /**< (AFEC_LCDR) Last Data Converted Mask */
#define AFEC_LCDR_LDATA(value)              (AFEC_LCDR_LDATA_Msk & ((value) << AFEC_LCDR_LDATA_Pos))
#define AFEC_LCDR_CHNB_Pos                  24                                             /**< (AFEC_LCDR) Channel Number Position */
#define AFEC_LCDR_CHNB_Msk                  (_U_(0xF) << AFEC_LCDR_CHNB_Pos)               /**< (AFEC_LCDR) Channel Number Mask */
#define AFEC_LCDR_CHNB(value)               (AFEC_LCDR_CHNB_Msk & ((value) << AFEC_LCDR_CHNB_Pos))
#define AFEC_LCDR_MASK                      _U_(0xF00FFFF)                                 /**< \deprecated (AFEC_LCDR) Register MASK  (Use AFEC_LCDR_Msk instead)  */
#define AFEC_LCDR_Msk                       _U_(0xF00FFFF)                                 /**< (AFEC_LCDR) Register Mask  */


/* -------- AFEC_IER : (AFEC Offset: 0x24) (/W 32) AFEC Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Enable 0     */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Enable 1     */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Enable 2     */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Enable 3     */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Enable 4     */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Enable 5     */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Enable 6     */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Enable 7     */
    uint32_t EOC8:1;                    /**< bit:      8  End of Conversion Interrupt Enable 8     */
    uint32_t EOC9:1;                    /**< bit:      9  End of Conversion Interrupt Enable 9     */
    uint32_t EOC10:1;                   /**< bit:     10  End of Conversion Interrupt Enable 10    */
    uint32_t EOC11:1;                   /**< bit:     11  End of Conversion Interrupt Enable 11    */
    uint32_t :12;                       /**< bit: 12..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Enable              */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Enable   */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Enable        */
    uint32_t :3;                        /**< bit: 27..29  Reserved */
    uint32_t TEMPCHG:1;                 /**< bit:     30  Temperature Change Interrupt Enable      */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t EOC:12;                    /**< bit:  0..11  End of Conversion Interrupt Enable x     */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_IER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_IER_OFFSET                     (0x24)                                        /**<  (AFEC_IER) AFEC Interrupt Enable Register  Offset */

#define AFEC_IER_EOC0_Pos                   0                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 0 Position */
#define AFEC_IER_EOC0_Msk                   (_U_(0x1) << AFEC_IER_EOC0_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 0 Mask */
#define AFEC_IER_EOC0                       AFEC_IER_EOC0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC0_Msk instead */
#define AFEC_IER_EOC1_Pos                   1                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 1 Position */
#define AFEC_IER_EOC1_Msk                   (_U_(0x1) << AFEC_IER_EOC1_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 1 Mask */
#define AFEC_IER_EOC1                       AFEC_IER_EOC1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC1_Msk instead */
#define AFEC_IER_EOC2_Pos                   2                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 2 Position */
#define AFEC_IER_EOC2_Msk                   (_U_(0x1) << AFEC_IER_EOC2_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 2 Mask */
#define AFEC_IER_EOC2                       AFEC_IER_EOC2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC2_Msk instead */
#define AFEC_IER_EOC3_Pos                   3                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 3 Position */
#define AFEC_IER_EOC3_Msk                   (_U_(0x1) << AFEC_IER_EOC3_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 3 Mask */
#define AFEC_IER_EOC3                       AFEC_IER_EOC3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC3_Msk instead */
#define AFEC_IER_EOC4_Pos                   4                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 4 Position */
#define AFEC_IER_EOC4_Msk                   (_U_(0x1) << AFEC_IER_EOC4_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 4 Mask */
#define AFEC_IER_EOC4                       AFEC_IER_EOC4_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC4_Msk instead */
#define AFEC_IER_EOC5_Pos                   5                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 5 Position */
#define AFEC_IER_EOC5_Msk                   (_U_(0x1) << AFEC_IER_EOC5_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 5 Mask */
#define AFEC_IER_EOC5                       AFEC_IER_EOC5_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC5_Msk instead */
#define AFEC_IER_EOC6_Pos                   6                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 6 Position */
#define AFEC_IER_EOC6_Msk                   (_U_(0x1) << AFEC_IER_EOC6_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 6 Mask */
#define AFEC_IER_EOC6                       AFEC_IER_EOC6_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC6_Msk instead */
#define AFEC_IER_EOC7_Pos                   7                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 7 Position */
#define AFEC_IER_EOC7_Msk                   (_U_(0x1) << AFEC_IER_EOC7_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 7 Mask */
#define AFEC_IER_EOC7                       AFEC_IER_EOC7_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC7_Msk instead */
#define AFEC_IER_EOC8_Pos                   8                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 8 Position */
#define AFEC_IER_EOC8_Msk                   (_U_(0x1) << AFEC_IER_EOC8_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 8 Mask */
#define AFEC_IER_EOC8                       AFEC_IER_EOC8_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC8_Msk instead */
#define AFEC_IER_EOC9_Pos                   9                                              /**< (AFEC_IER) End of Conversion Interrupt Enable 9 Position */
#define AFEC_IER_EOC9_Msk                   (_U_(0x1) << AFEC_IER_EOC9_Pos)                /**< (AFEC_IER) End of Conversion Interrupt Enable 9 Mask */
#define AFEC_IER_EOC9                       AFEC_IER_EOC9_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC9_Msk instead */
#define AFEC_IER_EOC10_Pos                  10                                             /**< (AFEC_IER) End of Conversion Interrupt Enable 10 Position */
#define AFEC_IER_EOC10_Msk                  (_U_(0x1) << AFEC_IER_EOC10_Pos)               /**< (AFEC_IER) End of Conversion Interrupt Enable 10 Mask */
#define AFEC_IER_EOC10                      AFEC_IER_EOC10_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC10_Msk instead */
#define AFEC_IER_EOC11_Pos                  11                                             /**< (AFEC_IER) End of Conversion Interrupt Enable 11 Position */
#define AFEC_IER_EOC11_Msk                  (_U_(0x1) << AFEC_IER_EOC11_Pos)               /**< (AFEC_IER) End of Conversion Interrupt Enable 11 Mask */
#define AFEC_IER_EOC11                      AFEC_IER_EOC11_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_EOC11_Msk instead */
#define AFEC_IER_DRDY_Pos                   24                                             /**< (AFEC_IER) Data Ready Interrupt Enable Position */
#define AFEC_IER_DRDY_Msk                   (_U_(0x1) << AFEC_IER_DRDY_Pos)                /**< (AFEC_IER) Data Ready Interrupt Enable Mask */
#define AFEC_IER_DRDY                       AFEC_IER_DRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_DRDY_Msk instead */
#define AFEC_IER_GOVRE_Pos                  25                                             /**< (AFEC_IER) General Overrun Error Interrupt Enable Position */
#define AFEC_IER_GOVRE_Msk                  (_U_(0x1) << AFEC_IER_GOVRE_Pos)               /**< (AFEC_IER) General Overrun Error Interrupt Enable Mask */
#define AFEC_IER_GOVRE                      AFEC_IER_GOVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_GOVRE_Msk instead */
#define AFEC_IER_COMPE_Pos                  26                                             /**< (AFEC_IER) Comparison Event Interrupt Enable Position */
#define AFEC_IER_COMPE_Msk                  (_U_(0x1) << AFEC_IER_COMPE_Pos)               /**< (AFEC_IER) Comparison Event Interrupt Enable Mask */
#define AFEC_IER_COMPE                      AFEC_IER_COMPE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_COMPE_Msk instead */
#define AFEC_IER_TEMPCHG_Pos                30                                             /**< (AFEC_IER) Temperature Change Interrupt Enable Position */
#define AFEC_IER_TEMPCHG_Msk                (_U_(0x1) << AFEC_IER_TEMPCHG_Pos)             /**< (AFEC_IER) Temperature Change Interrupt Enable Mask */
#define AFEC_IER_TEMPCHG                    AFEC_IER_TEMPCHG_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IER_TEMPCHG_Msk instead */
#define AFEC_IER_MASK                       _U_(0x47000FFF)                                /**< \deprecated (AFEC_IER) Register MASK  (Use AFEC_IER_Msk instead)  */
#define AFEC_IER_Msk                        _U_(0x47000FFF)                                /**< (AFEC_IER) Register Mask  */

#define AFEC_IER_EOC_Pos                    0                                              /**< (AFEC_IER Position) End of Conversion Interrupt Enable x */
#define AFEC_IER_EOC_Msk                    (_U_(0xFFF) << AFEC_IER_EOC_Pos)               /**< (AFEC_IER Mask) EOC */
#define AFEC_IER_EOC(value)                 (AFEC_IER_EOC_Msk & ((value) << AFEC_IER_EOC_Pos))  

/* -------- AFEC_IDR : (AFEC Offset: 0x28) (/W 32) AFEC Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Disable 0    */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Disable 1    */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Disable 2    */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Disable 3    */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Disable 4    */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Disable 5    */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Disable 6    */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Disable 7    */
    uint32_t EOC8:1;                    /**< bit:      8  End of Conversion Interrupt Disable 8    */
    uint32_t EOC9:1;                    /**< bit:      9  End of Conversion Interrupt Disable 9    */
    uint32_t EOC10:1;                   /**< bit:     10  End of Conversion Interrupt Disable 10   */
    uint32_t EOC11:1;                   /**< bit:     11  End of Conversion Interrupt Disable 11   */
    uint32_t :12;                       /**< bit: 12..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Disable             */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Disable  */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Disable       */
    uint32_t :3;                        /**< bit: 27..29  Reserved */
    uint32_t TEMPCHG:1;                 /**< bit:     30  Temperature Change Interrupt Disable     */
    uint32_t :1;                        /**< bit:     31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t EOC:12;                    /**< bit:  0..11  End of Conversion Interrupt Disable x    */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_IDR_Type;
