sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/afec.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief AFEC hardware registers */
typedef struct {  
  __O  AFEC_CR_Type                   AFEC_CR;        /**< Offset: 0x00 ( /W  32) AFEC Control Register */
  __IO AFEC_MR_Type                   AFEC_MR;        /**< Offset: 0x04 (R/W  32) AFEC Mode Register */
  __IO AFEC_EMR_Type                  AFEC_EMR;       /**< Offset: 0x08 (R/W  32) AFEC Extended Mode Register */
  __IO AFEC_SEQ1R_Type                AFEC_SEQ1R;     /**< Offset: 0x0C (R/W  32) AFEC Channel Sequence 1 Register */
  __IO AFEC_SEQ2R_Type                AFEC_SEQ2R;     /**< Offset: 0x10 (R/W  32) AFEC Channel Sequence 2 Register */
  __O  AFEC_CHER_Type                 AFEC_CHER;      /**< Offset: 0x14 ( /W  32) AFEC Channel Enable Register */
  __O  AFEC_CHDR_Type                 AFEC_CHDR;      /**< Offset: 0x18 ( /W  32) AFEC Channel Disable Register */
  __I  AFEC_CHSR_Type                 AFEC_CHSR;      /**< Offset: 0x1C (R/   32) AFEC Channel Status Register */
  __I  AFEC_LCDR_Type                 AFEC_LCDR;      /**< Offset: 0x20 (R/   32) AFEC Last Converted Data Register */
  __O  AFEC_IER_Type                  AFEC_IER;       /**< Offset: 0x24 ( /W  32) AFEC Interrupt Enable Register */
  __O  AFEC_IDR_Type                  AFEC_IDR;       /**< Offset: 0x28 ( /W  32) AFEC Interrupt Disable Register */
  __I  AFEC_IMR_Type                  AFEC_IMR;       /**< Offset: 0x2C (R/   32) AFEC Interrupt Mask Register */
  __I  AFEC_ISR_Type                  AFEC_ISR;       /**< Offset: 0x30 (R/   32) AFEC Interrupt Status Register */
  __I  uint32_t                       Reserved1[6];
  __I  AFEC_OVER_Type                 AFEC_OVER;      /**< Offset: 0x4C (R/   32) AFEC Overrun Status Register */
  __IO AFEC_CWR_Type                  AFEC_CWR;       /**< Offset: 0x50 (R/W  32) AFEC Compare Window Register */
  __IO AFEC_CGR_Type                  AFEC_CGR;       /**< Offset: 0x54 (R/W  32) AFEC Channel Gain Register */
  __I  uint32_t                       Reserved2[2];
  __IO AFEC_DIFFR_Type                AFEC_DIFFR;     /**< Offset: 0x60 (R/W  32) AFEC Channel Differential Register */
  __IO AFEC_CSELR_Type                AFEC_CSELR;     /**< Offset: 0x64 (R/W  32) AFEC Channel Selection Register */
  __I  AFEC_CDR_Type                  AFEC_CDR;       /**< Offset: 0x68 (R/   32) AFEC Channel Data Register */
  __IO AFEC_COCR_Type                 AFEC_COCR;      /**< Offset: 0x6C (R/W  32) AFEC Channel Offset Compensation Register */
  __IO AFEC_TEMPMR_Type               AFEC_TEMPMR;    /**< Offset: 0x70 (R/W  32) AFEC Temperature Sensor Mode Register */
  __IO AFEC_TEMPCWR_Type              AFEC_TEMPCWR;   /**< Offset: 0x74 (R/W  32) AFEC Temperature Compare Window Register */
  __I  uint32_t                       Reserved3[7];
  __IO AFEC_ACR_Type                  AFEC_ACR;       /**< Offset: 0x94 (R/W  32) AFEC Analog Control Register */
  __I  uint32_t                       Reserved4[2];
  __IO AFEC_SHMR_Type                 AFEC_SHMR;      /**< Offset: 0xA0 (R/W  32) AFEC Sample & Hold Mode Register */
  __I  uint32_t                       Reserved5[11];
  __IO AFEC_COSR_Type                 AFEC_COSR;      /**< Offset: 0xD0 (R/W  32) AFEC Correction Select Register */
  __IO AFEC_CVR_Type                  AFEC_CVR;       /**< Offset: 0xD4 (R/W  32) AFEC Correction Values Register */
  __IO AFEC_CECR_Type                 AFEC_CECR;      /**< Offset: 0xD8 (R/W  32) AFEC Channel Error Correction Register */
  __I  uint32_t                       Reserved6[2];
  __IO AFEC_WPMR_Type                 AFEC_WPMR;      /**< Offset: 0xE4 (R/W  32) AFEC Write Protection Mode Register */
  __I  AFEC_WPSR_Type                 AFEC_WPSR;      /**< Offset: 0xE8 (R/   32) AFEC Write Protection Status Register */
} Afec;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Analog Front-End Controller */

#endif /* _SAMS70_AFEC_COMPONENT_H_ */
